soiv-dmp-test/src/main/resources/com/ericsson/soiv/teststeps/protocols/bscs/sendBillGenerateRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bil="http://ericsson.com/services/ws_CIL_6/billprocesscreate" xmlns:ses="http://ericsson.com/services/ws_CIL_6/sessionchange">
    <soapenv:Header>
        <Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <UsernameToken>
                <Username>ADMX</Username>
                <Password>ADMX</Password>
            </UsernameToken>
        </Security>
    </soapenv:Header>
    <soapenv:Body>
        <bil:billprocessCreateRequest>
            <bil:inputAttributes>
            <bil:periodEndDate>{{billPeriodEndDate}}</bil:periodEndDate>
                <bil:requestType>B</bil:requestType>
                <bil:requestSubType>I</bil:requestSubType>
                <bil:customerKeyCollection>
                    <bil:item>
                        <bil:csIdPub>{{customerID}}</bil:csIdPub>
                    </bil:item>
                </bil:customerKeyCollection>

                <bil:contractTypeId>1</bil:contractTypeId>
                <bil:simulation>{{simulation}}</bil:simulation>

            </bil:inputAttributes>
            <bil:sessionChangeRequest>
                <ses:values>
                    <ses:item>
                        <ses:key>BU_ID</ses:key>
                        <ses:value>2</ses:value>
                    </ses:item>
                </ses:values>
            </bil:sessionChangeRequest>
        </bil:billprocessCreateRequest>
    </soapenv:Body>
</soapenv:Envelope>